In [1]:
import pandas as pd

In [2]:
t = (1,2,3,4)
t[1:3]

(2, 3)

In [3]:
dictionary = {"name":["Ali","Mehmet","Kübra"],
             "age":[12,13,None],
             "note":[23,None,78]}
dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age  note
0     Ali  12.0  23.0
1  Mehmet  13.0   NaN
2   Kübra   NaN  78.0

In [4]:
head = dataframe1.head() 
print(head)

     name   age  note
0     Ali  12.0  23.0
1  Mehmet  13.0   NaN
2   Kübra   NaN  78.0

In [5]:
tail = dataframe1.tail()
print(tail)

     name   age  note
0     Ali  12.0  23.0
1  Mehmet  13.0   NaN
2   Kübra   NaN  78.0

In [6]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [7]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     2 non-null      float64
 2   note    2 non-null      float64
dtypes: float64(2), object(1)
memory usage: 200.0+ bytes
None

In [8]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [9]:
print(dataframe1.describe())

             age       note
count   2.000000   2.000000
mean   12.500000  50.500000
std     0.707107  38.890873
min    12.000000  23.000000
25%    12.250000  36.750000
50%    12.500000  50.500000
75%    12.750000  64.250000
max    13.000000  78.000000

In [10]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])                    
dataframe1["yeniOzellik"] = [1,2,3]
print(dataframe1.loc[:3,"age"]) 
print(dataframe1.loc[:3, "name":"note"])              
print(dataframe1.loc[::-1])

0       Ali
1    Mehmet
2     Kübra
Name: name, dtype: object
0    12.0
1    13.0
2     NaN
Name: age, dtype: float64
0    12.0
1    13.0
2     NaN
Name: age, dtype: float64
     name   age  note
0     Ali  12.0  23.0
1  Mehmet  13.0   NaN
2   Kübra   NaN  78.0
     name   age  note  yeniOzellik
2   Kübra   NaN  78.0            3
1  Mehmet  13.0   NaN            2
0     Ali  12.0  23.0            1

In [11]:
print(dataframe1.yeniOzellik)

0    1
1    2
2    3
Name: yeniOzellik, dtype: int64

In [12]:
print(dataframe1.loc[:, "age"])

0    12.0
1    13.0
2     NaN
Name: age, dtype: float64

In [13]:
print(dataframe1.loc[:3,"age"])

0    12.0
1    13.0
2     NaN
Name: age, dtype: float64

In [14]:
print(dataframe1.loc[:3, "name":"note"])

     name   age  note
0     Ali  12.0  23.0
1  Mehmet  13.0   NaN
2   Kübra   NaN  78.0

In [15]:
print(dataframe1.loc[:3, ["name","note"]])

     name  note
0     Ali  23.0
1  Mehmet   NaN
2   Kübra  78.0

In [16]:
print(dataframe1.loc[::-1])

     name   age  note  yeniOzellik
2   Kübra   NaN  78.0            3
1  Mehmet  13.0   NaN            2
0     Ali  12.0  23.0            1

In [17]:
print(dataframe1.loc[:,:"age"])

     name   age
0     Ali  12.0
1  Mehmet  13.0
2   Kübra   NaN

In [18]:
print(dataframe1.iloc[:,[2]])

   note
0  23.0
1   NaN
2  78.0

In [19]:
filtreYas = dataframe1.age>10                          
dataframe1["bool"]= filtreYas
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  13.0   True
2   NaN  False

In [20]:
type(filtreYas)

pandas.core.series.Series

In [21]:
filtreNot = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtreNot&filtreYas] 
print(filtrelenmis_data2)

Empty DataFrame
Columns: [name, age, note, yeniOzellik, bool]
Index: []

In [22]:
dataframe1[dataframe1.age>20]

Empty DataFrame
Columns: [name, age, note, yeniOzellik, bool]
Index: []

In [23]:
import numpy as np
ortalama = dataframe1.note.mean() 
print(ortalama)
ortlama_np= np.mean(dataframe1.note) 
print(ortlama_np)

50.5
50.5

In [24]:
dataframe1.dropna(inplace=True) 
dataframe1

  name   age  note  yeniOzellik  bool
0  Ali  12.0  23.0            1  True

In [25]:
print(dataframe1.note.mean()) 

dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

23.0

  name   age  note  yeniOzellik  bool             ortalama
0  Ali  12.0  23.0            1  True  ortalamanın üstünde

In [26]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENIOZELLIK', 'BOOL', 'ORTALAMA'], dtype='object')

In [27]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] 
                      if len(each.split(" "))>1 
                      else each 
                      for each in dataframe1.columns]
dataframe1

  NAME   AGE  NOTE  YENIOZELLIK  BOOL             ORTALAMA
0  Ali  12.0  23.0            1  True  ortalamanın üstünde

In [28]:
dataframe1["buyuk_yas"] = [each*2 for each in dataframe1.AGE]
dataframe1

  NAME   AGE  NOTE  YENIOZELLIK  BOOL             ORTALAMA  buyuk_yas
0  Ali  12.0  23.0            1  True  ortalamanın üstünde       24.0

In [29]:
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

,NAME,AGE,NOTE,YENIOZELLIK,BOOL,ORTALAMA,buyuk_yas,apply_metodu
0,Ali,12.0,23.0,1,True,ortalamanın üstünde,24.0,24.0